Config/InformationRegisters/СоответствияАналитическихСчетовКЭК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоответствияАналитическихСчетовКЭК</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/СоответствияАналитическихСчетовКЭК/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗагрузитьНастройки");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗагрузитьНастройки(Очищать = Истина) Экспорт
	
	СпрКОСГУ  	= Справочники.КОСГУ;
	ПланСчетов 	= ПланыСчетов.ЕПСБУ;
	
	Регистр = РегистрыСведений.СоответствияАналитическихСчетовКЭК.СоздатьНаборЗаписей();
	Если Очищать Тогда
		Регистр.Очистить();
	КонецЕсли;	
	ТаблицаСоответствия = Регистр.Выгрузить();
	
    СпСчетов 	= ПолучитьМакет("НастройкиСоответствия").ПолучитьОбласть("Счета");
	КолВоСчетов = СпСчетов.ВысотаТаблицы;
	
	Для а = 1 По КолВоСчетов Цикл
		
		ИмяОбластиСчета = "Сч"+СпСчетов.ПолучитьОбласть(а, 1).ТекущаяОбласть.Текст;
		
		СпНастроек = ПолучитьМакет("НастройкиСоответствия").ПолучитьОбласть(ИмяОбластиСчета);
		КолВоНастроек = СпНастроек.ВысотаТаблицы;
		
		Для б = 1 По КолВоНастроек Цикл
			
			ТекКод = СпНастроек.ПолучитьОбласть(б, 1).ТекущаяОбласть.Текст;
			ДатаСтрокой = СпНастроек.ПолучитьОбласть(б, 2).ТекущаяОбласть.Текст;

			Если ЗначениеЗаполнено(ДатаСтрокой) Тогда
				ДатаНачалаДействия = Дата(Сред(ДатаСтрокой, 7, 4) + Сред(ДатаСтрокой, 4, 2) + Лев(ДатаСтрокой, 2));
			Иначе
				ДатаНачалаДействия = '00010101';
			КонецЕсли;	
				
			Счет  = ПланСчетов.СчетПоКоду(ТекКод, ДатаНачалаДействия);
			
			КОСГУ = СпрКОСГУ.НайтиПоКоду(СпНастроек.ПолучитьОбласть(б, 4).ТекущаяОбласть.Текст);
			
			Если НЕ ЗначениеЗаполнено(Счет) Тогда
				Продолжить;
			КонецЕСли;
			                                                             
			Если НЕ ЗначениеЗаполнено(КОСГУ) Тогда
				Продолжить;
			КонецЕСли;
			
			Строки = ТаблицаСоответствия.НайтиСтроки(Новый Структура("Счет, КЭК", Счет, КОСГУ));
			Если Строки.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;	

            НоваяСтрока = ТаблицаСоответствия.Добавить();
			НоваяСтрока.Счет  = Счет;
			НоваяСтрока.КЭК = КОСГУ;
			
		КонецЦикла;
		
	КонецЦикла;	
	
	Регистр.Загрузить(ТаблицаСоответствия);
	Регистр.Записать();
	
КонецПроцедуры	

#КонецОбласти
 
#КонецЕсли
